inletTest2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottomEmptyFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          38932;
        startFace       77437;
    }
    topEmptyFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          38932;
        startFace       116369;
    }
    inlet
    {
        type            patch;
        nFaces          130;
        startFace       155301;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       155431;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1343;
        startFace       155495;
    }
    symmetryLine
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          280;
        startFace       156838;
    }
)

// ************************************************************************* //
